data/openfoam/ellipsoids_u10/template_case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox       |
|  \\    /   O peration     | Version:  14                                  |
|   \\  /    A nd           | Web:      https://openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
    (-9 -9 -9)
    (9 -9 -9)
    (9 9 -9)
    (-9 9 -9)
    (-9 -9 9)
    (9 -9 9)
    (9 9 9)
    (-9 9 9)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (36 36 36) simpleGrading (1 1 1)
);

boundary
(
    farfield
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (1 2 6 5)
            (0 1 5 4)
            (3 7 6 2)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
