data/openfoam/ellipsoids_u10/template_case/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox       |
|  \\    /   O peration     | Version:  14                                  |
|   \\  /    A nd           | Web:      https://openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    body
    {
        type triSurface;
        file "body.stl";
    }
    wakeBox
    {
        type box;
        min (-1 -1.5 -1.5);
        max (6 1.5 1.5);
    }
};

castellatedMeshControls
{
    maxLocalCells       500000;
    maxGlobalCells      8000000;
    minRefinementCells  10;
    maxLoadUnbalance    0.10;
    nCellsBetweenLevels 3;

    features
    (
    );

    refinementSurfaces
    {
        body
        {
            level (4 4);
        }
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
        wakeBox
        {
            mode    inside;
            level   2;
        }
    }

    insidePoint (5 5 5);

    allowFreeStandingZoneFaces false;
}

snapControls
{
    nSmoothPatch    3;
    tolerance       4.0;
    nSolveIter      100;
    nRelaxIter      5;

    nFeatureSnapIter 10;
    implicitFeatureSnap true;
    explicitFeatureSnap false;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes       false;

    layers
    {
        "body.*"
        {
            nSurfaceLayers 6;
        }
    }

    expansionRatio      1.25;
    firstLayerThickness 0.011;
    minThickness        0.00275;

    nGrow               0;

    featureAngle        130;
    slipFeatureAngle    30;

    nRelaxIter          5;
    nSmoothSurfaceNormals 1;
    nSmoothNormals      3;
    nSmoothThickness    10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle  90;
    nBufferCellsNoExtrude 0;
    nLayerIter          50;
}

meshQualityControls
{
    maxNonOrtho         65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave          80;
    minFlatness         0.5;
    minVol              1e-13;
    minTetQuality       1e-15;
    minArea             -1;
    minTwist            0.02;
    minDeterminant      0.001;
    minFaceWeight       0.02;
    minVolRatio         0.01;
    minTriangleTwist    -1;
    nSmoothScale        4;
    errorReduction      0.75;
}

mergeTolerance 1e-6;


// ************************************************************************* //
