data/openfoam/ellipsoids_u10/template_case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox       |
|  \\    /   O peration     | Version:  14                                  |
|   \\  /    A nd           | Web:      https://openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [velocity];

internalField   uniform (1 0 0);

boundaryField
{
    farfield
    {
        type            freestreamVelocity;
        freestreamValue uniform (1 0 0);
    }
    "body.*"
    {
        type            noSlip;
    }
}


// ************************************************************************* //
